In [2]:
people = {
    'First':['Corey','Jane','Joe'],
    'Last':['Schafer','Doe','Doe'],
    'Email':['CoreySchafergmail.com','JaneDoe@gmail.com','JohnDoe@gmail.com']
}

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [5]:
df

   First     Last                  Email
0  Corey  Schafer  CoreySchafergmail.com
1   Jane      Doe      JaneDoe@gmail.com
2    Joe      Doe      JohnDoe@gmail.com

In [6]:
#to add columns
df['Full_name']=df['First'] + ' ' + df['Last']

In [7]:
df

   First     Last                  Email      Full_name
0  Corey  Schafer  CoreySchafergmail.com  Corey Schafer
1   Jane      Doe      JaneDoe@gmail.com       Jane Doe
2    Joe      Doe      JohnDoe@gmail.com        Joe Doe

In [10]:
# to delete columns

df.drop(columns=['First','Last'],inplace=True)

In [11]:
df

                   Email      Full_name
0  CoreySchafergmail.com  Corey Schafer
1      JaneDoe@gmail.com       Jane Doe
2      JohnDoe@gmail.com        Joe Doe

In [13]:
df[['First','Last']]=df['Full_name'].str.split(' ',expand=True)

In [14]:
df

                   Email      Full_name  First     Last
0  CoreySchafergmail.com  Corey Schafer  Corey  Schafer
1      JaneDoe@gmail.com       Jane Doe   Jane      Doe
2      JohnDoe@gmail.com        Joe Doe    Joe      Doe

In [15]:
people = {
    'First':['Tony','Steve'],
    'Last':['Stark','Rogers'],
    'Email':['IronMan@avenge.com','Cap@avenge.com']
}

In [16]:
df2=pd.DataFrame(people)
df2

   First    Last               Email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [18]:
df.append(df2,ignore_index=True,sort=False)

                   Email      Full_name  First     Last
0  CoreySchafergmail.com  Corey Schafer  Corey  Schafer
1      JaneDoe@gmail.com       Jane Doe   Jane      Doe
2      JohnDoe@gmail.com        Joe Doe    Joe      Doe
3     IronMan@avenge.com            NaN   Tony    Stark
4         Cap@avenge.com            NaN  Steve   Rogers

In [19]:
df=df.append(df2,ignore_index=True,sort=False)

In [20]:
df

                   Email      Full_name  First     Last
0  CoreySchafergmail.com  Corey Schafer  Corey  Schafer
1      JaneDoe@gmail.com       Jane Doe   Jane      Doe
2      JohnDoe@gmail.com        Joe Doe    Joe      Doe
3     IronMan@avenge.com            NaN   Tony    Stark
4         Cap@avenge.com            NaN  Steve   Rogers

In [21]:
df.drop(index=3)

                   Email      Full_name  First     Last
0  CoreySchafergmail.com  Corey Schafer  Corey  Schafer
1      JaneDoe@gmail.com       Jane Doe   Jane      Doe
2      JohnDoe@gmail.com        Joe Doe    Joe      Doe
4         Cap@avenge.com            NaN  Steve   Rogers

In [22]:
filt=df['Last']=='Doe'
df.drop(index=df[filt].index)

                   Email      Full_name  First     Last
0  CoreySchafergmail.com  Corey Schafer  Corey  Schafer
3     IronMan@avenge.com            NaN   Tony    Stark
4         Cap@avenge.com            NaN  Steve   Rogers